Tekla Open API Reference for Tekla Structures 2025
Part.CompareTo Method
Overload List
Name | Description
CompareTo(Object)
 Compares Identifiers of model objects.
 (Inherited from ModelObject.)
CompareTo(Part)
 Compares the instantiated part with another one.
Top
See Also
Reference
Part Class
Tekla.Structures.Model Namespace